#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # time_static.creation will be created
  + resource "time_static" "creation" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + delimiter           = "-"
  + enabled             = true
  + id                  = ""
  + id_length_limit     = 0
  + label_order         = [
      + "namespace",
      + "environment",
      + "stage",
      + "name",
      + "attributes",
    ]
  + regex_replace_chars = "/[^a-zA-Z0-9-]/"
  + tags                = {}

```

</details>

*Pushed by: @tuxtek, Action: `pull_request`*